Австралия/src/InformationRegisters/JobsForProductionScheduleCalculation/JobsForProductionScheduleCalculation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>JobsForProductionScheduleCalculation</name>
  <dimensions>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ManufacturingOperation</name>
    <type>
      <types>DocumentRef.ManufacturingOperation</types>
    </type>
  </dimensions>
  <dimensions>
    <name>JobNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/ProductionSchedule/ProductionSchedule.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProductionSchedule</name>
  <resources>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>EndDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ManualChanges</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ScheduleState</name>
    <comment>Status 0 - work schedule; status 1 - preliminary schedule (calculated but not saved)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Operation</name>
    <type>
      <types>DocumentRef.ManufacturingOperation</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Activity</name>
    <type>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ConnectionKey</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/ProductionOrdersPriorities/ProductionOrdersPriorities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProductionOrdersPriorities</name>
  <resources>
    <name>Priority</name>
    <type>
      <types>CatalogRef.ProductionOrdersPriorities</types>
    </type>
  </resources>
  <resources>
    <name>PriorityOrder</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Queue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/AccumulationRegisters/ManufacturingProcessSupply/ManufacturingProcessSupply.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ManufacturingProcessSupply</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Required</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>TransferredToProduction</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Scheduled</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Produced</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Reference</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/InformationRegisters/ProductionOrdersStates/ProductionOrdersStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProductionOrdersStates</name>
  <resources>
    <name>State</name>
    <type>
      <types>EnumRef.ProductionOrdersStates</types>
    </type>
  </resources>
  <dimensions>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ManufacturingOperationStatuses/ManufacturingOperationStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ManufacturingOperationStatuses</name>
  <enumValues>
    <name>Open</name>
  </enumValues>
  <enumValues>
    <name>InProcess</name>
  </enumValues>
  <enumValues>
    <name>Completed</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ProductionOrdersStates/ProductionOrdersStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionOrdersStates</name>
  <enumValues>
    <name>CreateStages</name>
  </enumValues>
  <enumValues>
    <name>PlanStages</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/ProductionOrder/ProductionOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionOrder</name>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.SubcontractorOrderReceived</basedOn>
  <registerRecords>AccumulationRegister.ManufacturingProcessSupply</registerRecords>
  <registerRecords>AccumulationRegister.ProductionOrders</registerRecords>
  <registerRecords>AccumulationRegister.ProductionComponents</registerRecords>
  <registerRecords>AccumulationRegister.InventoryDemand</registerRecords>
  <registerRecords>AccumulationRegister.ReservedProducts</registerRecords>
  <registerRecords>AccumulationRegister.ProductRelease</registerRecords>
  <registerRecords>AccumulationRegister.Backorders</registerRecords>
  <registerRecords>AccumulationRegister.InventoryFlowCalendar</registerRecords>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnitReserve</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderState</name>
    <type>
      <types>CatalogRef.ProductionOrderStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Priority</name>
    <type>
      <types>CatalogRef.ProductionOrdersPriorities</types>
    </type>
  </attributes>
  <attributes>
    <name>UseProductionPlanning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrderPosition</name>
    <type>
      <types>EnumRef.AttributeStationing</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductsType</name>
      <type>
        <types>EnumRef.ProductsTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Catalogs/ManufacturingActivities/ManufacturingActivities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ManufacturingActivities</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>StandardWorkload</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CostPool</name>
    <type>
      <types>CatalogRef.CostPools</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeUOM</name>
    <type>
      <types>CatalogRef.TimeUOM</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardTimeInUOM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StandardTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>WorkCenterTypes</name>
    <attributes>
      <name>WorkcenterType</name>
      <type>
        <types>CatalogRef.CompanyResourceTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/JobsForProductionScheduleCalculation/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure AddJobs(Operations) Export
	
	JobNumber = Constants.NumberOfJobToTheProductionScheduleCalculation.Get();
	
	BeginTransaction();
	
	Try
		
		If TypeOf(Operations) = Type("Array")
			And Operations.Count() > 1 Then
			
			Query = New Query;
			Query.Text = 
			"SELECT
			|	JobsForProductionScheduleCalculation.ProductionOrder AS ProductionOrder,
			|	JobsForProductionScheduleCalculation.ManufacturingOperation AS ManufacturingOperation,
			|	JobsForProductionScheduleCalculation.JobNumber AS JobNumber
			|INTO TT_Records
			|FROM
			|	InformationRegister.JobsForProductionScheduleCalculation AS JobsForProductionScheduleCalculation
			|WHERE
			|	JobsForProductionScheduleCalculation.JobNumber = &JobNumber
			|
			|UNION ALL
			|
			|SELECT
			|	ManufacturingOperation.BasisDocument,
			|	ManufacturingOperation.Ref,
			|	&JobNumber
			|FROM
			|	Document.ManufacturingOperation AS ManufacturingOperation
			|WHERE
			|	ManufacturingOperation.Ref IN(&Operations)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT DISTINCT
			|	TT_Records.ProductionOrder AS ProductionOrder,
			|	TT_Records.ManufacturingOperation AS ManufacturingOperation,
			|	TT_Records.JobNumber AS JobNumber
			|FROM
			|	TT_Records AS TT_Records";
			
			Query.SetParameter("JobNumber", JobNumber);
			Query.SetParameter("Operations", Operations);
			
			QueryResult = Query.Execute().Unload();
			
			RecordSet = InformationRegisters.JobsForProductionScheduleCalculation.CreateRecordSet();
			RecordSet.Filter.JobNumber.Set(JobNumber);
			RecordSet.Load(QueryResult);
			RecordSet.Write();
			
		Else
			
			ManufacturingOperation = Undefined;
			
			If TypeOf(Operations) = Type("DocumentRef.ManufacturingOperation") Then
				
				ManufacturingOperation = Operations;
				
			ElsIf TypeOf(Operations) = Type("Array") And Operations.Count() = 1 Then
				
				ManufacturingOperation = Operations[0];
				
			EndIf;
			
			If ManufacturingOperation <> Undefined
				And Common.ObjectAttributeValue(ManufacturingOperation, "Status") = Enums.ManufacturingOperationStatuses.Open Then
				
				Manager = InformationRegisters.JobsForProductionScheduleCalculation.CreateRecordManager();
				Manager.ProductionOrder = Common.ObjectAttributeValue(ManufacturingOperation, "BasisDocument");
				Manager.ManufacturingOperation = ManufacturingOperation;
				Manager.JobNumber = JobNumber;
				Manager.Write();
				
			EndIf;
			
		EndIf;
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		EventName = NStr("en = 'Add jobs to the production schedule calculation'; ru = 'Добавить задания в расчет графика производства';pl = 'Dodaj prace do obliczenia planowania produkcji';es_ES = 'Añadir las tareas para el cálculo del programa de producción';es_CO = 'Añadir las tareas para el cálculo del programa de producción';tr = 'Üretim takvimi hesaplamasına iş ekle';it = 'Aggiungere lavori al calcolo della pianificazione di produzione';de = 'Arbeiten zur Berechnung des Produktionsplans hinzufügen'", CommonClientServer.DefaultLanguageCode());
		
		WriteLogEvent(
			EventName,
			EventLogLevel.Error,
			,
			,
			DetailErrorDescription(ErrorInfo()));
		
	EndTry;
	
EndProcedure

Procedure DeleteJobs(ProductionOrder, JobNumber = Undefined) Export
	
	If JobNumber = Undefined Then
		JobNumber = Constants.NumberOfJobToTheProductionScheduleCalculation.Get();
	EndIf;
	
	BeginTransaction();
	
	Try
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	JobsForProductionScheduleCalculation.ProductionOrder AS ProductionOrder,
		|	JobsForProductionScheduleCalculation.ManufacturingOperation AS ManufacturingOperation,
		|	JobsForProductionScheduleCalculation.JobNumber AS JobNumber
		|INTO TT_AllRecords
		|FROM
		|	InformationRegister.JobsForProductionScheduleCalculation AS JobsForProductionScheduleCalculation
		|WHERE
		|	JobsForProductionScheduleCalculation.ProductionOrder = &ProductionOrder
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	JobsForProductionScheduleCalculation.ProductionOrder AS ProductionOrder,
		|	JobsForProductionScheduleCalculation.ManufacturingOperation AS ManufacturingOperation,
		|	JobsForProductionScheduleCalculation.JobNumber AS JobNumber
		|INTO TT_RecordsToDelete
		|FROM
		|	InformationRegister.JobsForProductionScheduleCalculation AS JobsForProductionScheduleCalculation
		|WHERE
		|	JobsForProductionScheduleCalculation.ProductionOrder = &ProductionOrder
		|	AND JobsForProductionScheduleCalculation.JobNumber <= &JobNumber
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	TT_AllRecords.ProductionOrder AS ProductionOrder,
		|	TT_AllRecords.ManufacturingOperation AS ManufacturingOperation,
		|	TT_AllRecords.JobNumber AS JobNumber
		|FROM
		|	TT_AllRecords AS TT_AllRecords
		|		LEFT JOIN TT_RecordsToDelete AS TT_RecordsToDelete
		|		ON TT_AllRecords.ProductionOrder = TT_RecordsToDelete.ProductionOrder
		|			AND TT_AllRecords.ManufacturingOperation = TT_RecordsToDelete.ManufacturingOperation
		|			AND TT_AllRecords.JobNumber = TT_RecordsToDelete.JobNumber
		|WHERE
		|	TT_RecordsToDelete.ProductionOrder IS NULL";
		
		Query.SetParameter("JobNumber", JobNumber);
		Query.SetParameter("ProductionOrder", ProductionOrder);
		
		QueryResult = Query.Execute().Unload();
		
		RecordSet = InformationRegisters.JobsForProductionScheduleCalculation.CreateRecordSet();
		RecordSet.Filter.ProductionOrder.Set(ProductionOrder);
		RecordSet.Load(QueryResult);
		RecordSet.Write();
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		EventName = NStr("en = 'Delete jobs from the production schedule calculation'; ru = 'Удалить задания из расчета графика производства';pl = 'Usuń prace z obliczenia planowania produkcji';es_ES = 'Borrar las tareas para el cálculo del programa de producción';es_CO = 'Borrar las tareas para el cálculo del programa de producción';tr = 'Üretim takvimi hesaplamasından iş sil';it = 'Eliminare lavori dal calcolo della pianificazione di produzione';de = 'Arbeiten aus der Berechnung des Produktionsplans entfernen'", CommonClientServer.DefaultLanguageCode());
		
		WriteLogEvent(
			EventName,
			EventLogLevel.Error,
			,
			,
			DetailErrorDescription(ErrorInfo()));
		
	EndTry;
	
EndProcedure

Function WIPIsActual(ManufacturingOperation) Export
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	JobsForProductionScheduleCalculation.ManufacturingOperation AS ManufacturingOperation
	|FROM
	|	InformationRegister.JobsForProductionScheduleCalculation AS JobsForProductionScheduleCalculation
	|WHERE
	|	JobsForProductionScheduleCalculation.ManufacturingOperation = &ManufacturingOperation";
	
	Query.SetParameter("ManufacturingOperation", ManufacturingOperation);
	
	QueryResult = Query.Execute();
	
	Return QueryResult.IsEmpty();
	
EndFunction

Procedure AddAllOperationsOfOrder(ProductionOrder) Export
	
	If Common.ObjectAttributeValue(ProductionOrder, "Posted") = True
		And OrderInProgress(ProductionOrder) Then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	ManufacturingOperation.Ref AS WIP
		|FROM
		|	Document.ManufacturingOperation AS ManufacturingOperation
		|WHERE
		|	ManufacturingOperation.Posted
		|	AND ManufacturingOperation.BasisDocument = &ProductionOrder
		|	AND ManufacturingOperation.Status = VALUE(Enum.ManufacturingOperationStatuses.Open)";
		
		Query.SetParameter("ProductionOrder", ProductionOrder);
		
		Operations = Query.Execute().Unload().UnloadColumn("WIP");
		
		AddJobs(Operations);
		
		CheckWIPsQueue(Operations);
		
	EndIf;
	
EndProcedure

// Checks the queue of WIPs and adds new WIPs for planning
// Every open WIP which uses the same WCT on the same period (and has lower order) will be added to the queue
Procedure CheckWIPsQueue(WIPs, OrdersToExclude = Undefined) Export
	
	If OrdersToExclude = Undefined Then
		OrdersToExclude = New Array;
	EndIf;
	
	AddStartesOrdersInOrdersToExclude(OrdersToExclude);
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	ManufacturingOperationActivities.Activity AS Activity,
	|	ManufacturingActivitiesWorkCenterTypes.WorkcenterType AS WorkcenterType,
	|	ProductionOrderDoc.Ref AS ProductionOrder,
	|	ManufacturingActivitiesWorkCenterTypes.Ref AS WIP,
	|	CASE
	|		WHEN ProductionSchedule.StartDate IS NULL
	|			THEN ProductionOrderDoc.Start
	|		WHEN ProductionOrderDoc.Start <= ProductionSchedule.StartDate
	|			THEN ProductionOrderDoc.Start
	|		ELSE ProductionSchedule.StartDate
	|	END AS Start
	|INTO TT_WorkCenterTypes
	|FROM
	|	Document.ManufacturingOperation.Activities AS ManufacturingOperationActivities
	|		INNER JOIN Catalog.ManufacturingActivities.WorkCenterTypes AS ManufacturingActivitiesWorkCenterTypes
	|		ON ManufacturingOperationActivities.Activity = ManufacturingActivitiesWorkCenterTypes.Ref
	|		INNER JOIN Document.ProductionOrder AS ProductionOrderDoc
	|		ON ManufacturingOperationActivities.Ref.BasisDocument = ProductionOrderDoc.Ref
	|		LEFT JOIN InformationRegister.ProductionSchedule AS ProductionSchedule
	|		ON ManufacturingOperationActivities.Ref = ProductionSchedule.Operation
	|WHERE
	|	ManufacturingOperationActivities.Ref IN(&WIPs)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ManufacturingOperationActivities.Ref.BasisDocument AS ProductionOrder,
	|	ManufacturingOperationActivities.Ref AS WIP,
	|	TT_WorkCenterTypes.Start AS Start
	|INTO TT_AllMatchingOrders
	|FROM
	|	Document.ManufacturingOperation.Activities AS ManufacturingOperationActivities
	|		INNER JOIN Catalog.ManufacturingActivities.WorkCenterTypes AS ManufacturingActivitiesWorkCenterTypes
	|		ON ManufacturingOperationActivities.Activity = ManufacturingActivitiesWorkCenterTypes.Ref
	|		INNER JOIN TT_WorkCenterTypes AS TT_WorkCenterTypes
	|		ON (ManufacturingActivitiesWorkCenterTypes.WorkcenterType = TT_WorkCenterTypes.WorkcenterType)
	|WHERE
	|	NOT ManufacturingOperationActivities.Ref IN (&WIPs)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	TT_AllMatchingOrders.ProductionOrder AS ProductionOrder
	|INTO TT_AllLaterPlannedOrders
	|FROM
	|	TT_AllMatchingOrders AS TT_AllMatchingOrders
	|		INNER JOIN InformationRegister.ProductionSchedule AS ProductionSchedule
	|		ON TT_AllMatchingOrders.WIP = ProductionSchedule.Operation
	|			AND TT_AllMatchingOrders.Start <= ProductionSchedule.StartDate
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ReplanningOrdersPriorities.ProductionOrder AS ProductionOrder,
	|	SUM(ISNULL(ManufacturingProcessSupplyTurnovers.ScheduledTurnover, 0)) AS Scheduled
	|FROM
	|	InformationRegister.ProductionOrdersPriorities AS ProductionOrdersPriorities
	|		INNER JOIN InformationRegister.ProductionOrdersPriorities AS ReplanningOrdersPriorities
	|		ON (CASE
	|				WHEN ProductionOrdersPriorities.PriorityOrder < ReplanningOrdersPriorities.PriorityOrder
	|					THEN TRUE
	|				WHEN ProductionOrdersPriorities.PriorityOrder = ReplanningOrdersPriorities.PriorityOrder
	|					THEN ProductionOrdersPriorities.Queue < ReplanningOrdersPriorities.Queue
	|				ELSE FALSE
	|			END)
	|		LEFT JOIN AccumulationRegister.ManufacturingProcessSupply.Turnovers AS ManufacturingProcessSupplyTurnovers
	|		ON (ReplanningOrdersPriorities.ProductionOrder = ManufacturingProcessSupplyTurnovers.Reference)
	|WHERE
	|	ProductionOrdersPriorities.ProductionOrder IN
	|			(SELECT
	|				TT_WorkCenterTypes.ProductionOrder AS ProductionOrder
	|			FROM
	|				TT_WorkCenterTypes AS TT_WorkCenterTypes)
	|	AND ReplanningOrdersPriorities.ProductionOrder IN
	|			(SELECT
	|				TT_AllLaterPlannedOrders.ProductionOrder AS ProductionOrder
	|			FROM
	|				TT_AllLaterPlannedOrders AS TT_AllLaterPlannedOrders)
	|
	|GROUP BY
	|	ReplanningOrdersPriorities.ProductionOrder";
	
	Query.SetParameter("WIPs", WIPs);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		
		If SelectionDetailRecords.Scheduled = 0
			And OrdersToExclude.Find(SelectionDetailRecords.ProductionOrder) = Undefined Then
		
			AddAllOperationsOfOrder(SelectionDetailRecords.ProductionOrder);
		
		EndIf;
		
	EndDo;
	
EndProcedure

#EndRegion

#Region Private

Function OrderInProgress(ProductionOrder)
	
	Result = False;
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	ProductionOrdersStates.State AS State
		|FROM
		|	InformationRegister.ProductionOrdersStates AS ProductionOrdersStates
		|WHERE
		|	ProductionOrdersStates.ProductionOrder = &ProductionOrder";
	
	Query.SetParameter("ProductionOrder", ProductionOrder);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	If SelectionDetailRecords.Next() Then
		
		Result = (SelectionDetailRecords.State = Enums.ProductionOrdersStates.PlanStages);
		
	EndIf;
	
	Return Result;
	
EndFunction

Procedure AddStartesOrdersInOrdersToExclude(OrdersToExclude)
	
	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	ManufacturingOperation.BasisDocument AS ProductionOrder
	|FROM
	|	Document.ManufacturingOperation AS ManufacturingOperation
	|WHERE
	|	ManufacturingOperation.Status <> VALUE(Enum.ManufacturingOperationStatuses.Open)";
	
	StartedOrders = Query.Execute().Unload().UnloadColumn("ProductionOrder");
	
	CommonClientServer.SupplementArray(OrdersToExclude, StartedOrders, True);
	
EndProcedure

#EndRegion

#EndIf
